# Требования к проекту
## 1 Введение

Счетчик калорий. В данном приложении будет возможность считать количество употребляемых калорий
2 Требования пользователя
### 2.1 Программные интерфейсы
Проект будет реализован на языке программирования Java 1.8.
2.2 Интерфейс пользователя
Пользователь за счет различных вкладок сможет просматривать информацию о количестве калорий в определенной пище и суммарное количество полученных калорий в день
2.3 Характеристики пользователей
Любой пользователь желающий следить за своим телом
3 Системные требования
3.1 Функциональные требования
1. Возможность просмотра полученных калорий
2. Возможность просмотра калорий в определенной еде
3. Расчет индекса массы тела
4. Норма калорий для пользователя в зависимости от того, с какой целью он пользуется приложением
3.2 Нефункциональные требования
Приложение должно быть доступно любому пользователю с доступом в интернет
4 Обзор аналогов
приложение Yazio


